# -*- mode:org -*-
#+Options: ^:nil
##+CATEGORY: bugpile

*** TODO Use Cases in textual form
    :LOGBOOK:
    CLOCK: [2012-05-03 Do 18:27]--[2012-05-03 Do 18:30] =>  0:03
    CLOCK: [2012-05-03 Do 18:25]--[2012-05-03 Do 18:26] =>  0:01
    CLOCK: [2012-05-03 Do 18:16]--[2012-05-03 Do 18:18] =>  0:02
    :END:

**** DONE [req-uc-txt] Add user to assignees
     CLOSED: [2012-05-03 Do 18:00] SCHEDULED: <2012-05-03 Do>
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2012-05-03 Do 18:00]
     CLOCK: [2012-05-03 Do 17:24]--[2012-05-03 Do 17:59] =>  0:35
     :END:
Deleted, is special case of search users and take actions on selected
users. 
**** DONE [req-uc-txt] Remove user from assignees
     CLOSED: [2012-05-03 Do 18:16] SCHEDULED: <2012-05-03 Do>
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2012-05-03 Do 18:16]
     CLOCK: [2012-05-03 Do 17:59]--[2012-05-03 Do 18:16] =>  0:17
     :END:

Deleted, is special case of search users and take actions on selected
users. 

**** DONE [req-uc-txt] Add user to notification list
     CLOSED: [2012-05-03 Do 18:25] SCHEDULED: <2012-05-03 Do>
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2012-05-03 Do 18:25]
     CLOCK: [2012-05-03 Do 18:18]--[2012-05-03 Do 18:25] =>  0:07
     :END:
Deleted, is a special case of 'take action on selected task'

**** DONE [req-uc-txt] Remove reminder
     CLOSED: [2012-05-03 Do 18:27] SCHEDULED: <2012-05-03 Do>
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2012-05-03 Do 18:27]
     CLOCK: [2012-05-03 Do 18:26]--[2012-05-03 Do 18:27] =>  0:01
     :END:

Deleted, is a special case of 'take action on selected task'

*** TODO Integrated UML Modelling of Use Cases and UI
    :LOGBOOK:
    CLOCK: [2012-05-05 Sa 20:07]--[2012-05-06 So 11:46] => 15:39
    :END:

**** DONE [req-uc-uml] Take action on selected users
     CLOSED: [2012-05-05 Sa 20:07] SCHEDULED: <2012-05-05 Sa>
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2012-05-05 Sa 20:07]
     CLOCK: [2012-05-05 Sa 19:18]--[2012-05-05 Sa 20:07] =>  0:49
     :END:
**** TODO Integrated UML Modelling of Use Cases and UI
     :LOGBOOK:
     CLOCK: [2012-05-05 Sa 16:37]--[2012-05-05 Sa 19:18] =>  2:41
     :END:
******* DONE [spec-uc-uml] Register as user
        CLOSED: [2012-05-05 Sa 15:34] SCHEDULED: <2012-05-03 Do>
        :LOGBOOK:
        - State "DONE"       from "NEXT"       [2012-05-05 Sa 15:34]
        CLOCK: [2012-05-05 Sa 13:43]--[2012-05-05 Sa 15:34] =>  1:51
        :END:
******* DONE [spec-uc-uml] Edit user details
        CLOSED: [2012-05-05 Sa 16:14] SCHEDULED: <2012-05-03 Do>
        :LOGBOOK:
        - State "DONE"       from "NEXT"       [2012-05-05 Sa 16:14]
        CLOCK: [2012-05-05 Sa 15:34]--[2012-05-05 Sa 16:14] =>  0:40
        :END:

******* DONE [spec-uc-uml] Login
        CLOSED: [2012-05-05 Sa 16:25] SCHEDULED: <2012-05-03 Do>
        :LOGBOOK:
        - State "DONE"       from "NEXT"       [2012-05-05 Sa 16:25]
        CLOCK: [2012-05-05 Sa 16:14]--[2012-05-05 Sa 16:25] =>  0:11
        :END:

******* DONE [spec-uc-uml] Logout
        CLOSED: [2012-05-05 Sa 16:37] SCHEDULED: <2012-05-03 Do>
        :LOGBOOK:
        - State "DONE"       from "NEXT"       [2012-05-05 Sa 16:37]
        CLOCK: [2012-05-05 Sa 16:25]--[2012-05-05 Sa 16:37] =>  0:12
        :END:
******* DONE [spec-uc-uml] Take action on selected users
        CLOSED: [2012-05-06 So 19:45] SCHEDULED: <2012-05-05 Sa>
        :LOGBOOK:
        - State "DONE"       from "NEXT"       [2012-05-06 So 19:45]
        CLOCK: [2012-05-06 So 19:30]--[2012-05-06 So 19:45] =>  0:15
        :END:
